micropython/micropython/ports/nxp/board/evkmimxrt1050/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "evkmimxrt1050"
#define MICROPY_HW_MCU_NAME "imxrt1052"
#define MICROPY_MIN_USE_IMXRT1052_MCU (1)

/* Enable LVGL */
#define MICROPY_PY_LVGL             (1)
#define MICROPY_PY_LPI2C            (1)